app/controllers/posts_controller.rb

  def index
    #required a new post variable so we can post on the index page
    @post = Post.new
    @post.build_book
    @posts = Post.find(:all, :conditions => {:user_id => [@currentUser].concat(@currentUser.return_list_of_followed_users)}, \
                        :order => "created_at DESC")
---
SELECT "follows".id FROM "follows" WHERE (user_id = 7 AND follow_user_id = 7) LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."user_id" = '15,-612645818') ORDER BY created_at DESC
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def show
    @post = Post.find_by_id(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = '12312') LIMIT 1

  def edit
    @post = Post.find_by_id(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = '12312') LIMIT 1

  def create
    @post = Post.new(params[:post])
    @post.user = @currentUser
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("mood", "updated_at", "thoughts", "user_id", "book_id", "location", "created_at") VALUES('Ecstatic', '2010-08-26 12:17:55', 'Not a bad book on all counts. Sometimes I wonder if the author knows what he is on about!', NULL, 1, 'Rock Vegas', '2010-08-26 12:17:55')

  def destroy
    @post = Post.find(params[:id])
    @post.destroy if @post.user == @currentUser
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)
DELETE FROM "posts" WHERE "id" = 2