app/controllers/users_controller.rb

  def user_posts
    @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1

  def follow
    userToFollow = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1

  def unfollow
    userToUnFollow = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1

  def index
    #Get all users but the current user
    @users = User.find(:all, :conditions => ["id <> ?", @currentUser.id], :order => :username)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def show
    @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 6) LIMIT 1

  def edit
    @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("salt", "updated_at", "hashed_password", "username", "created_at") VALUES('-6125923380.238791862921851', '2010-08-28 05:59:53', '4eacd85cee7d7781e1358b6e9c0a7ce24708587f', 'Jed', '2010-08-28 05:59:53')

  def update
    @user = User.find_by_id(params[:id])
    if @user == @currentUser #only allow update if it is the current user editting
      respond_to do |format|
        if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1
UPDATE "users" SET "hashed_password" = 'e356e5b23683a3a5c8f8e4b9f12db03fb3717834', "updated_at" = '2010-08-28 07:45:30', "salt" = '-6137457080.562290891390166' WHERE "id" = 7

  def destroy
    @user = User.find_by_id(params[:id])
    begin
      @user.destroy if @user == @currentUser
---
SELECT * FROM "users" WHERE ("users"."id" = 4) LIMIT 1
DELETE FROM "users" WHERE "id" = 2